<a href="https://colab.research.google.com/github/radhikajain2411/machine-learning/blob/main/SFO_public_Department.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Data Manipulation
DESCRIPTION

SFO Public Department, referred to as SFO, has captured the salary data of all its employees for the years 2011-2014. Now in 2018, the organization is facing some financial crisis. As a first step, HR wants to rationalize employee cost to save payroll budget. You have to perform data manipulation and answer the questions below:

1. How much total salary cost has increased from year 2011 to 2014?
2. Who was the top-earning employee across all the years?
Objective: Perform data manipulation and visualization techniques.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Salaries.csv")

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df

            Id              EmployeeName  ...         Agency  Status
0            1            NATHANIEL FORD  ...  San Francisco     NaN
1            2              GARY JIMENEZ  ...  San Francisco     NaN
2            3            ALBERT PARDINI  ...  San Francisco     NaN
3            4         CHRISTOPHER CHONG  ...  San Francisco     NaN
4            5           PATRICK GARDNER  ...  San Francisco     NaN
...        ...                       ...  ...            ...     ...
117713  117716          Joel R Salmonson  ...  San Francisco      FT
117714  117717           Rebecca S Paras  ...  San Francisco      PT
117715  117718             Norman T Wong  ...  San Francisco      FT
117716  117719  Arlene M Licudine-Barker  ...  San Francisco      FT
117717   11772                       NaN  ...            NaN     NaN

[117718 rows x 13 columns]

In [4]:
df.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [5]:
df.isnull().any()

Id                  False
EmployeeName         True
JobTitle             True
BasePay              True
OvertimePay          True
OtherPay             True
Benefits             True
TotalPay             True
TotalPayBenefits     True
Year                 True
Notes                True
Agency               True
Status               True
dtype: bool

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117718 entries, 0 to 117717
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                117718 non-null  int64
 1   EmployeeName      117717 non-null  object
 2   JobTitle          117717 non-null  object
 3   BasePay           117112 non-null  float64
 4   OvertimePay       117717 non-null  float64
 5   OtherPay          117717 non-null  float64
 6   Benefits          81559 non-null   float64
 7   TotalPay          117717 non-null  float64
 8   TotalPayBenefits  117717 non-null  float64
 9   Year              117717 non-null  float64
 10  Notes             0 non-null       float64
 11  Agency            117717 non-null  object
 12  Status            7188 non-null    object
dtypes: float64(8), int64(1), object(4)
memory usage: 11.7+ MB

In [9]:
df.shape

(117718, 13)

In [11]:
df.sort_values(by=['TotalPay'],ascending=False)

            Id        EmployeeName  ...         Agency  Status
0            1      NATHANIEL FORD  ...  San Francisco     NaN
1            2        GARY JIMENEZ  ...  San Francisco     NaN
110529  110532         David Shinn  ...  San Francisco      PT
110530  110533          Amy P Hart  ...  San Francisco      FT
36158    36160      Gary Altenberg  ...  San Francisco     NaN
...        ...                 ...  ...            ...     ...
106773  106776     Gerard  Gleason  ...  San Francisco     NaN
106772  106775        Monica J Moy  ...  San Francisco     NaN
106771  106774  Lawanna D Harrison  ...  San Francisco     NaN
110528  110531       David P Kucia  ...  San Francisco     NaN
117717   11772                 NaN  ...            NaN     NaN

[117718 rows x 13 columns]

How much total salary cost has increased from year 2011 to 2014?

In [12]:
pay_2011 = df.query("Year == 2011")['TotalPay'].sum()

In [13]:
pay_2012 = df.query("Year == 2012")['TotalPay'].sum()

In [14]:
incresed_cost = pay_2012-pay_2011

Total Increased Cost

In [16]:
incresed_cost

130623286.50999975

Who was the top-earning employee across all the years?

In [49]:
df_2011 = df[df['Year'] == 2011]
df_2012 = df[df['Year'] == 2012]
df_2013 = df[df['Year'] == 2013]
df_2014 = df[df['Year'] == 2014]

The top earning employee from each year.
Since 2011-2014

In [52]:
df_2011_top_employee = df_2011[['TotalPay','EmployeeName','JobTitle']].sort_values(by=['TotalPay'], ascending=False).head(1)
df_2011_top_employee

    TotalPay    EmployeeName                                        JobTitle
0  567595.43  NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY

In [62]:
df_2012_top_employee = df_2012[['TotalPay','EmployeeName','JobTitle']].sort_values(by=['TotalPay'], ascending=False).head(1)
df_2012_top_employee

        TotalPay    EmployeeName                      JobTitle
36158  362844.66  Gary Altenberg  Lieutenant, Fire Suppression

In [63]:
df_2013_top_employee = df_2013[['TotalPay','EmployeeName','JobTitle']].sort_values(by=['TotalPay'], ascending=False).head(1)
df_2013_top_employee

        TotalPay EmployeeName                        JobTitle
72925  347102.32  Samson  Lai  Battalion Chief, Fire Suppress

In [ ]:
df_2014_top_employee = df_2014[['TotalPay','EmployeeName','JobTitle']].sort_values(by=['TotalPay'], ascending=False).head(1)
df_2014_top_employee

Visualization of top-employee salary in diff. years

In [65]:
max_salary_2011 = df_2011.sort_values(by=['TotalPay'], ascending=False).head(1)
max_salary_2012 = df_2012.sort_values(by=['TotalPay'], ascending=False).head(1)
max_salary_2013 = df_2013.sort_values(by=['TotalPay'], ascending=False).head(1)
max_salary_2014 = df_2014.sort_values(by=['TotalPay'], ascending=False).head(1)